UbiquityRobotics/Arduino/hardware/ubiquity/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

bus_beaglebone.name=Ubiquity busbeagle_bone

bus_beaglebone.upload.tool=avrdude
bus_beaglebone.upload.protocol=arduino
bus_beaglebone.upload.maximum_size=32256
bus_beaglebone.upload.maximum_data_size=2048
bus_beaglebone.upload.speed=115200

bus_beaglebone.bootloader.tool=avrdude
bus_beaglebone.bootloader.low_fuses=0xFF
bus_beaglebone.bootloader.high_fuses=0xDE
bus_beaglebone.bootloader.extended_fuses=0x05
bus_beaglebone.bootloader.unlock_bits=0x3F
bus_beaglebone.bootloader.lock_bits=0x0F
bus_beaglebone.bootloader.file=optiboot/optiboot_atmega328.hex

bus_beaglebone.build.mcu=atmega324p
bus_beaglebone.build.f_cpu=16000000L
bus_beaglebone.build.board=AVR_BUS_BEAGLEBONE
bus_beaglebone.build.core=arduino
bus_beaglebone.build.variant=atmega324p

##############################################################

bus_bridge_encoders_sonar.name=Ubiquity bus_bridge_encoders_sonar

bus_bridge_encoders_sonar.upload.tool=avrdude
bus_bridge_encoders_sonar.upload.protocol=arduino
bus_bridge_encoders_sonar.upload.maximum_size=32256
bus_bridge_encoders_sonar.upload.maximum_data_size=2048
bus_bridge_encoders_sonar.upload.speed=115200

bus_bridge_encoders_sonar.bootloader.tool=avrdude
bus_bridge_encoders_sonar.bootloader.low_fuses=0xFF
bus_bridge_encoders_sonar.bootloader.high_fuses=0xDE
bus_bridge_encoders_sonar.bootloader.extended_fuses=0x05
bus_bridge_encoders_sonar.bootloader.unlock_bits=0x3F
bus_bridge_encoders_sonar.bootloader.lock_bits=0x0F
bus_bridge_encoders_sonar.bootloader.file=optiboot/optiboot_atmega328.hex

bus_bridge_encoders_sonar.build.mcu=atmega328p
bus_bridge_encoders_sonar.build.f_cpu=16000000L
bus_bridge_encoders_sonar.build.board=AVR_BUS_BRIDGE_ENCODERS_SONAR
bus_bridge_encoders_sonar.build.core=arduino
bus_bridge_encoders_sonar.build.variant=standard

